Repository: skowront/SymulatorNSP2021
Catalog: SymulatorNSP.GUI.Core/Resources/Resource.*.resx
Languages: de_de, pl_pl

source: Address
de_de: Adresse
pl_pl: Adres

source: Algorithm
de_de: Algorithmus
pl_pl: Algorytm

source: Browser
pl_pl: Przeglądarka

source: Cancel
de_de: Stornieren
pl_pl: Anuluj

source: Choose random
de_de: zufällig auswählen
pl_pl: Wybierz losowo

source: Classified as
de_de: Klassifiziert als
pl_pl: Zaklasyfikowany jako

source: Clear
de_de: Löschen
pl_pl: Wyczyść

source: Close
de_de: Schließen
pl_pl: Zamknij

source: Confirm
de_de: Bestätigen
pl_pl: Zatwierdź

source: Congratulations!
de_de: Glückwünsche!
pl_pl: Gratulacje!

# CreationProgressUpdate
source: Created {0} out of {1}.
de_de: {0} aus {1} erstellt.
pl_pl: Utworzono {0} z {1}.

# DesiredPopulationCount
source: Set desired population count
de_de: Legen Sie die erwartete Populationsgröße fest
pl_pl: Ustaw oczekiwaną wielkość populacji

# DesiredPopulationCountRangeError
source: Expected population be between 0 and 100000000
de_de: Die Bevölkerung muss im Bereich von 0 bis 100000000 liegen
pl_pl: Populacja musi być z zakresu 0 do 100000000

# DistanceCalculationMethod
source: Select difference calculation method
de_de: Legen Sie die Berechnungsmethode für die Entfernung fest
pl_pl: Ustaw metodę obliczania odległości edycyjnej

# DistanceExaplanation
source: Some people might have an error in their entries. For example misspelling in nationality like "german" they might have an entry "g3rman". Here you can select an algorithm that will tolerate errors (up to a few characters changed). Select "-" if you want to see only exact matches in the query matching process and disable any tolerance to errors. By searching "unrecognized" in filter field for a specific query you can check how many entries had too big differences from options defined in generator configuration and would need to be manually classified to a group. Try doing the queries with and without Editing Distance calculation algorithms and see what you will get. This is just a simple example of what we can achieve with modern computing power and algorithms. In real life scenarios it is not a problem to automatically sort, bucket and minimize the amount of outliers for manual classifications. If you want to learn more check out unsupervised machine learning algorithms and fuzzy string matching.
de_de: Einige Leute haben möglicherweise einen Tippfehler in ihrem Eintrag. Beispielsweise könnte in der Nationalität „deutsch“ „ni3deutsch“ sein. Hier können Sie einen Algorithmus auswählen, der Fehler toleriert (bis auf wenige geänderte Zeichen). Wählen Sie "-", wenn Sie nur an Datensätzen interessiert sind, die genau mit der Option übereinstimmen, wodurch die Toleranz deaktiviert wird. Indem Sie im Filter nach „undefiniert“ suchen, prüfen Sie, wie viele der Datensätze zu keiner Option passen und auch mit dem verwendeten Algorithmus nicht klassifiziert werden konnten (diese müssten manuell klassifiziert werden). Dies ist natürlich nur ein einfaches Beispiel für Algorithmen, die den Datensatzklassifizierungsprozess automatisieren können. In realen Szenarien werden unüberwachte maschinelle Lernalgorithmen verwendet, die nicht nur in der Lage sind, Aufzeichnungen selbst zu klassifizieren, sondern auch Gruppen zu erstellen, die zuvor nicht vorhergesagt wurden (z. B. Warschauer Nationalität). Wenn Sie mehr erfahren möchten, sehen Sie sich „unbeaufsichtigte Algorithmen für maschinelles Lernen“ oder „fuzzy string matching“ an.
pl_pl: Niektóre osoby mogą mieć literówkę w swoim wpisie. Na przykład w narodowości "niemiecka" mogło być "ni3miecka". Tutaj możesz wybrać algoryrm, który będzie tolerował błędy (do kilku zmienionych znaków). Wybierz "-" jeśli interesują cię tylko rekordy dokładnie pasujące do opcji, co wyłączy tolerancję. Wyszukując "nieustalona" w filtrze sprawdzisz ile z rekordów nie pasowało do żadnej opcji i nie udało się ich zaklasyfikować nawet z wykorzystanym algorytmem (te musiałyby być zaklasyfikowane manualnie). To jest, oczywiście, tylko prosty przykład algorytmów, które mogą automatyzować proces klasyfikacji rekordów. W scenariuszach rzeczywistych stosuje się algorytmy nienadzorowanego uczenia maszynowego, które nie tylko potrafią same klasyfikować rekordy, ale także tworzyć grupy, których nie przewidziano wcześniej (np. narodowość warszawska). Jeśli chcesz się dowiedzieć więcej, zapoznaj się z "algoryrmami nienadzorowanego uczenia maszynowego".

source: Editing distance
de_de: Abstand bearbeiten
pl_pl: Dystans edycyjny

source: Enter file name
de_de: Geben Sie einen Dateinamen ein
pl_pl: Wpisz nazwę pliku

source: Error
de_de: Fehler
pl_pl: Błąd

source: Ethnicity - error rate:
de_de: Ethnizitätsfehler Prozentsatz:
pl_pl: Procent błędów etniczności:

# EthnicityMaxErrorImpact
source: Ethnicity - maximum number of affected letters:
de_de: Maximale Anzahl Tippfehler:
pl_pl: Maksymalna liczba literówek:

source: Execute query
de_de: Mache eine Anfrage
pl_pl: Wykonaj zapytanie

source: Execution time
de_de: Ausführungszeit der Abfrage
pl_pl: Czas wykonywania zapytania

source: Failure
de_de: Ausfall
pl_pl: Porażka

source: FinishStep
de_de: Beenden Sie den Schritt
pl_pl: Zakończ krok

# FitFailure
source: ERROR: Original {0} could not be classified. Smallest editing distance was equal to: {2} for option {1} and the algorithm used {3}
de_de: FEHLER: Original {0} konnte nicht klassifiziert werden. Der kleinste Bearbeitungsabstand war: {2} für Option {1} unter Verwendung des {3}-Algorithmus
pl_pl: BŁĄD: Oryginał {0} nie mógł być zaklasyfikowany. Najmniejszy dystans edycyjny wyniósł: {2} dla opcji {1} przy wykorzystaniu algorytmu {3}

# FitSuccess
source: SUCCESS Original {0} was classified as {1}. Editing distance was equal to: {2} and the algorithm used {3}
de_de: ERFOLG: Original {0} wurde als {1} klassifiziert. Die Bearbeitungsdistanz war {2} für den {3}-Algorithmus
pl_pl: SUKCES: Oryginał {0} został zaklasyfikowany jako {1}. Odległość edycyjna wyniosła {2} dla algorytmu {3}

# GDPRAdminTitle
source: Data Administrator
de_de: Administrator personenbezogener Daten
pl_pl: Administrator danych osobowych

# GDPRPrivacyPolicyLabel
source: Privacy Policy
de_de: Datenschutz-Bestimmungen
pl_pl: Polityka prywatności

# GDRPLabel
source: GDPR
de_de: DSGVO
pl_pl: RODO

# Generate
source: Generate population
de_de: Bevölkerung generieren
pl_pl: Generuj populację

# GeneratePopulationFirst
source: Please generate population first!
de_de: Erstellen Sie zuerst eine Bevölkerung!
pl_pl: Najpierw wygeneruj populację!

source: Generation Configuration
de_de: Generationsaufbau
pl_pl: Konfiguracja generowania

# GenerationConfigurationDescription
source: Depending on the records that are randomly generated you will get various query execution times. Each record has a few properties (eg. Name, Surname, Nationality...) and each property value (eg. Smith or De-La-Rosa-Ramirez) length will also impact the execution times. You can change the list of property values that will be available to the generator and probability with which they will be chosen. Configurations also contain some properties that simulate (real-life scenario) misspelings in Nationality property values for the generated population. Feel free to change these preset values and edit the configuration in next steps.
de_de: Abhängig von den generierten Datensätzen kann die Ausführungszeit der Abfrage variieren. Jeder Datensatz hat mehrere Eigenschaften (Vorname, Nachname usw.) und jede Eigenschaft hat einen Wert (Smith, Ramirez usw.), dessen Länge die Leistung beeinträchtigen kann. Sie können die Liste der Werte, die der Generator verwendet, und die Wahrscheinlichkeit, mit der sie gezeichnet werden, ändern. Die Konfiguration enthält auch Eigenschaften, die die Fehlerwahrscheinlichkeit und die Auswirkung des Fehlers auf die Anzahl der Tippfehler für die Nationalitätseigenschaft bestimmen. Ändern Sie diese Eigenschaften nach Belieben.
pl_pl: W zależności od wygenerowanych rekordów, czas wykonywania zapytań może się różnić. Każdy rekord ma kilka własności (Imię, Nazwisko, etc.) a każda własność ma wartość (Smith, Ramirez,...), której długość może mieć wpływ na wydajność. Możesz zmienić listę wartości, z których będzie korzystał generator i prawdopodobieństwo z jakim zostaną wylosowane. Konfiguracja zawiera też właności, które określają szansę na błąd i wpływ błędu na liczbę literówek dla własności jaką jest narodowość. Zmień te własności według uznania.

source: Help
de_de: Hilfe
pl_pl: Pomoc

source: Job
de_de: Beruf
pl_pl: Zawód

source: Language
de_de: Sprache
pl_pl: Język

# Load
source: Load population
de_de: Bevölkerung laden
pl_pl: Wczytaj populację

# LoadFailed
source: File was not loaded
de_de: Die Datei wurde nicht geladen
pl_pl: Plik nie został załadowany

# LoadSuccess
source: File loaded successfully
de_de: Die Datei wurde geladen
pl_pl: PLik został załadowany

source: Log population sample
de_de: Sehen Sie sich eine Stichprobe der Bevölkerung an
pl_pl: Podejrzyj próbkę populacji

source: Logs
pl_pl: Logi

source: More
de_de: Mehr
pl_pl: Więcej

source: Name
pl_pl: Imię

source: Nationality
de_de: Staatsangehörigkeit
pl_pl: Narodowość

source: Nationality - error rate
de_de: Prozentsatz der Fehler bei der Staatsangehörigkeit
pl_pl: Procent błędów w narodowości

# NationalityMaxErrorImpact
source: Nationality - maximum number of affected letters
de_de: Maximale Anzahl Tippfehler bei der Nationalität
pl_pl: Maksymalna liczba literówek w narodowości

source: Nickname
de_de: Pseudonym
pl_pl: Pseudonim

source: Number of records
de_de: Die Anzahl der Datensätze, die die Bedingung erfüllen|Anzahl aller
pl_pl: Liczba rekordów spełniających warunek|Liczba wszystkich

source: or
de_de: oder
pl_pl: lub

source: Original
pl_pl: Oryginał

source: Performance factor
de_de: Effizienzfaktor
pl_pl: Współczynnik wydajności

# PerformanceFactorExplanation
source: Based on your execution time and records count we calculate a fair performance factor relative to GUS computation time. It is relative to number of records that GUS had to calculate, so if your query was done in 5 sec for 1 mln records, your factor will be divided by ~(1/38).
de_de: Basierend auf Ihrer Abfrageausführungszeit und der Anzahl der von Ihnen analysierten Datensätze haben wir den Leistungsfaktor im Vergleich zu der Zeit berechnet, die das Statistisches Hauptamt benötigt hat, um die Ergebnisse bereitzustellen. Der Koeffizient wird relativ zur Anzahl der Datensätze berechnet, die das Statistisches Hauptamt gemessen hat, d. h. wenn Ihre Zeit 5 Sekunden für 1 Million Datensätze betrug, teilen wir sie durch ~38.
pl_pl: Bazując na twoim czasie wykonania zapytania i liczbie rekordów, które przeanalizowałeś, obliczyliśmy współczynnik wydajności w porównaniu z czasem jaki GUS potrzebował na podanie wyników. Współczynnik jest obliczany relatywnie do liczby rekordów, z którymi mierzył się GUS, czyli jeśli twój czas wyniósł 5 sekund dla 1 mln rekordów to podzielimy go przez ~38.

source: Person
pl_pl: Osoba

# PersonStringified
source: Name: {0} Surname: {1} Address: {2} Religion: {3} Nationality: {4} Job: {5}
de_de: Name: {0} Nachname: {1} Adresse {2} Religion: {3} Nationalität: {4} Beruf: {5}
pl_pl: Imię: {0} Nazwisko: {1} Adres: {2} Religia: {3} Narodowość: {4} Zawód: {5}

# QueriedRecordsCount
source: Number of records queried
de_de: Die Anzahl der analysierten Datensätze
pl_pl: Liczba przeanalizowanych rekordów

source: Queries
de_de: Anfragen
pl_pl: Zapytania

source: Query end
de_de: Ende der Abfrage
pl_pl: Koniec zapytania

# QueryEthnicity
source: Query by ethnicity
de_de: Ethnizitätsabfrage
pl_pl: Zapytanie o etniczność

source: Query execution time
de_de: Ausführungszeit der Abfrage
pl_pl: Czas wykonywania zapytania

# QueryLimitThousandSamples
source: You can't print more than 1000 samples!
de_de: Sie können nicht mehr als 1000 Muster drucken!
pl_pl: Nie możesz wypisać więcej niż 1000 próbek!

# QueryNationality
source: Query by nationality
de_de: Abfrage der Staatsangehörigkeit
pl_pl: Zapytanie o narodowość

# QueryNationalityOrEthnicity
source: Query in both nationality and ethnicity
de_de: Nach Nationalität und ethnischer Zugehörigkeit gefragt
pl_pl: Zapytane o narodowość i etniczność

# QueryResultsCount
source: Number of matches | Total
de_de: Die Anzahl der Datensätze, die die |-Bedingung erfüllen Die Zahl aller
pl_pl: Liczba rekordów spełniających warunek | Liczba wszystkich

source: Query start
de_de: Der Beginn der Abfrage
pl_pl: Początek zapytania

# QueryValue
source: Query filter
de_de: Abfragefilter
pl_pl: Filtr zapytania

# RealLifeComparisonStringCotent
source: You queried {0} records and counted them all in {1} seconds. Central Statistical Office needed more than {2} seconds to query ~38 mln records. Congratulations you are {3} times faster!
de_de: Sie haben {0} Datensätze in {1} Sekunden analysiert. Das Statistisches Hauptamt benötigte {2} Sekunden, um ~38 Millionen Datensätze zu prüfen. Bravo, du bist {3} mal schneller!
pl_pl: Przeanalizowałeś {0} rekordów w {1} sekund. Główne Urząd Statystyczny potrzebował {2} sekund żeby sprawdić ~38 mln rekordów. Brawo, jesteś {3} razy szybszy!

# RealLifeComparisonStringTitle
source: Congratulations!
de_de: Glückwünsche!
pl_pl: Gratulacje!

# RecordKey
source: Key
de_de: Taste
pl_pl: Klucz

# RecordKeyExplanation
source: If this is your first submission this key will be used to protect your record from being overwritten. Otherwise please enter the same Nickname and Key pair to overrwrite your previous result in the leaderboard.
de_de: Wenn Sie zum ersten Mal ein Ergebnis senden, wird dieser Schlüssel verwendet, um Ihren Datensatz vor dem Überschreiben zu schützen. Andernfalls geben Sie denselben Schlüssel ein, den Sie zuvor verwendet haben, um die Punktzahl unter diesem Spitznamen zu korrigieren.
pl_pl: Jeśli to twój pierwszy raz kiedy wysyłasz wynik, to ten klucz zostanie wykorzystany do ochrony twojego rekordu przed nadpisaniem. W przeciwnym razie podaj ten sam klucz, którego używałeś poprzednio, aby poprawić wynik spod tego Pseudonimu.

source: Religion
pl_pl: Religia

source: Result
de_de: Ergebnis
pl_pl: Wynik

# Save
source: Save population
de_de: Speichern die Bevölkerung
pl_pl: Zapisz populację

# SaveFailed
source: File was not saved
de_de: Die Datei wurde nicht gespeichert
pl_pl: Plik nie został zapisany

# SaveSuccess
source: File saved successfully
de_de: Die Datei wurde gespeichert
pl_pl: Plik został zapisany

# SendResultsToLeaderboard
source: Send result to leaderboard
de_de: An die Anzeigetafel senden
pl_pl: Wyślij do tablicy wyników

source: Settings
de_de: Einstellungen
pl_pl: Ustawienia

source: Share
de_de: Teilen
pl_pl: Podziel się

source: Source
de_de: Quelle
pl_pl: Źródło

# Step1
source: Step 1. Generate population
de_de: Schritt 1. Bevölkerung generieren
pl_pl: Krok 1. Generuj Populację

# Step10
source: Step 10. Share your results
de_de: Schritt 10. Senden Sie die Ergebnisse an das Scoreboard
pl_pl: Krok 10. Wyślij wyniki do tablicy wyników

# Step2
source: Step 2. View sample population record
de_de: Schritt 2. Sehen Sie sich eine Stichprobe der Grundgesamtheit an
pl_pl: Krok 2. Podejrzyj próbkę populacji

# Step3
source: Step 3. Perform queries
de_de: Schritt 3. Führen Sie Abfragen aus
pl_pl: Krok 3. Wykonaj zapytania

# Step4
source: Step 4. (Optional) Change configuration
de_de: Schritt 4. (Optional) Neu konfigurieren
pl_pl: Krok 4. (Opcjonalny) Zmień konfigurację

# Step4Finish
source: Finish step 4
de_de: Schließen Sie Schritt 4 ab
pl_pl: Ukończ krok 4

# Step4nExplanation
source: Please feel free to make changes to the configuration. You can add options for generating objects, change error chance and error impact for nationality property to simulate real life scenario. Later you can use difference calculating algorithms to automate process of bucketing entries with errors into available options.
de_de: Versuchen Sie, Konfigurationsänderungen vorzunehmen. Optionen zu generierten Objekten hinzufügen, Fehlerwahrscheinlichkeit und Fehlerauswirkung ändern. Später können Sie verschiedene Bearbeitungsalgorithmen verwenden, um die Klassifizierung von Einträgen in vorhandene Optionen zu automatisieren.
pl_pl: Spróbuj wykonać zmiany w konfiguracji. Dodaj opcje do generowanych obiektów, zmień szansę na błąd i wpływ błędu. Później możesz użyć różnych algorytmów edycyjnych do automatyzacji klasyfikowania wpisów do istniejących opcji.

# Step4p1
source: Step 4.1 (Optional) Change error rate
de_de: Krok 4.1 (Opcjonalny) Zmień szansę na błąd
pl_pl: Krok 4.1 (Opcjonalny) Zmień szansę na błąd

# Step4p1Explanation
source: You can change the error rate of nationality in the records. That way you can simulate real-life scenario. By changing error rate you change the chance that a generated record will contain a misspelling. By changing the impact parameter you specify what is the maximum number of misspelled characters. Keep in mind that bucketing function that calculates editing distance in further steps has a hardcoded limit of 2 misspelled characters. Any record with more than 2 characters that do not match any option will remain unbucketable.
de_de: Sie können die Wahrscheinlichkeit eines Tippfehlers in einem Datensatz ändern. Dadurch wird ein reales Szenario simuliert, in dem ein Eintrag möglicherweise nicht mit den vorhandenen Optionen übereinstimmt. Durch Ändern der maximalen Fehlerausgabe legen Sie fest, wie viele Zeichen bei diesem Vorgang geändert werden können. Beachten Sie, dass die Klassifizierungsfunktionen dieser Anwendung eine feste Toleranz von 3 haben. Datensätze mit mehr als 2 geänderten Zeichen werden automatisch unklassifiziert.
pl_pl: Możesz zmienić szansę na literówkę w rekordzie. W ten sposób zasymulujesz rzeczywisty scenariusz, w którym wpis mógł niepasować do istniejących opcji. Zmieniając maksymalny wypływ błędu określisz ile znaków może zostać zmienionych w tym procesie. Pamiętaj, że funkcje klasyfikujące z tej aplikacji mają ustlony sztywny próg tolerancji wynoszący 3. Rekordy, które mają więcej niż 2 zmienione znaki pozostaną nieklasyfikowalne automatycznie.

# Step4p2
source: Step 4.2 (Optional) Change configuration details
de_de: Schritt 4.2 (Optional) Ändern Sie die Konfiguration
pl_pl: Krok 4.2 (Opcjonalny) Zmień konfigurację

# Step4p2Explanation
source: Here you can edit all the details of the configuration. It is presented as JSON object. Make sure that you unfocus from editor only when the configuration contains no formatting errors. Any changes will be lost if you change to any other preset configuration or if the configuration was incorrect. To avoid format errors try using any external tool like: https://jsonformatter.curiousconcept.com/
de_de: Hier können Sie Konfigurationsdetails ändern. Sie werden im JSON-Format dargestellt. Stellen Sie sicher, dass Sie ein Bearbeitungsfeld nicht deaktivieren, wenn es Fehler enthält. Die fehlerhafte Konfiguration wird bei allen Änderungen verworfen. Um Formatierungsfehler zu vermeiden, verwenden Sie externe Tools wie: https://jsonformatter.curiousconcept.com/
pl_pl: Tutaj możesz zmienić szczegóły konfiguracj. Są zaprezentowane w formacie JSON. Upewnij się, że nie odklikujesz pola edycyjnego jeśli zawiera ono błędy. Błędna konfiguracja zostanie odrzucona wraz z wszystkimi zmianami. Aby uniknąć błędów formatowania skorzystaj z zewnętrznych narzędzi jak: https://jsonformatter.curiousconcept.com/

# Step4p3
source: Step 4.3 (Optional) Change number of CPU threads
de_de: Schritt 4.3 (Optional) Ändern Sie die Anzahl der CPU-Threads
pl_pl: Krok 4.3 (Opcjonalny) Zmień liczbę wątków procesora

# Step5
source: Step 5. (Optional) Regenerate population with custom configuration
de_de: Schritt 5. (Optional) Regenerieren Sie die Population
pl_pl: Krok 5. (Opcjonalny) Ponownie wygeneruj populację

# Step6
source: Step 6. (Optional) Enable transparency mode
de_de: Schritt 6. (Optional) Aktivieren Sie den transparenten Modus
pl_pl: Krok 6. (Opcjonalny) Włącz tryb transparentny

# Step7
source: Step 7. (Optional ) Select editing distance calculation method
de_de: Schritt 7. (Optional) Wählen Sie einen Bearbeitungsalgorithmus
pl_pl: Krok 7. (Opcjonalny) Wybierz algorytm edycyjny

# Step8
source: Step 8. (Optional) View sample population record
de_de: Schritt 8. (Optional) Vorschau einer Stichprobe der Grundgesamtheit
pl_pl: Krok 8. (Opcjonalny) Podejrzyj próbkę populacji

# Step9
source: Step 9. (Optional) Query with custom configuration
de_de: Schritt 9. (Optional) Führen Sie Abfragen mit geänderter Konfiguration aus
pl_pl: Krok 9. (Opcjonalny) Wykonaj zapytania ze zmienioną konfiguracją

source: Submit
de_de: Schicken
pl_pl: Wyślij

source: Success
de_de: Erfolg
pl_pl: Sukces

source: Surname
de_de: Name
pl_pl: Nazwisko

source: Threads
de_de: Fäden
pl_pl: Wątki

source: Total number of records
de_de: Anzahl der Datensätze
pl_pl: Liczba rekordów

# TransparenceModePrerequisites
source: Transparency mode will show results if you meet all these conditions: NationalityErrorRate is bigger than zero, your records do contain misspellings (they might not have misspellings if your error rate and generated population size were small), NationalityMaxImpact is bigger than 0, TransparencyMode is enabled and you are using either Levenstein or Hamming algorithm (if none of them is in use, then there are no results to be shown, because only exact ones are classified).
de_de: Der transparente Modus zeigt Ihnen Ergebnisse, wenn alle der folgenden Bedingungen erfüllt sind: Nationalitätsfehlerwahrscheinlichkeit ist größer als Null, Ihre Datensätze enthalten Tippfehler (möglicherweise nicht, wenn Ihre Population und Fehlerwahrscheinlichkeit gering ist), Nationalitäts-Maximal-Tippfehler ist größer als Null, transparenter Modus aktiviert ist, verwenden Sie den Levenstein- oder Hamming-Algorithmus (wenn Sie "-" verwenden, werden keine Datensätze angezeigt, da Sie nur exakte Übereinstimmungen klassifizieren).
pl_pl: Tryb transparentny pokaże Ci wyniki jeśli spełnisz wszystkie poniższe warunki: Szansa na błąd w narodowości jest większa od zera, twoje rekordy mają literówki (mogą nie mieć, jeśli twoja populacja i szansa na błąd są małe), maksymalna liczba literówek w narodowości jest większa od zera, tryb transparentny jest włączony, wykorzystujesz algorytm Levensteina lub Hamminga (jeśli korzystasz z "-" nie będzie żadnych rekordów do pokazania, bo klasyfikujesz tylko dokładne dopasowania).

# TransparenctModeOFF
source: Transparency mode is nof OFF!
de_de: Transparentmodus deaktiviert!
pl_pl: Tryb transparentny wyłączony!

source: Transparency mode
de_de: Transparenter Modus
pl_pl: Tryb transparentny

# TransparencyModeExplanation
source: Transparent mode will show you information about automatic fitting of error-like entries (the ones misspelings if you configured ErrorRate and ErrorMaxImpact in previous steps). Keep in mind that, it might negatively impact the application performance and query execution time.
de_de: Der transparente Modus zeigt Ihnen Informationen über Übereinstimmungen von Datensätzen mit Tippfehlern (die Sie in den vorherigen Schritten konfiguriert haben). Beachten Sie, dass sich dieser Modus negativ auf die Ausführungszeit der Abfrage auswirken kann.
pl_pl: Tryb transparentny pokaże Ci informacje o dopasowaniach rekordów z literówkami (które konfigurowałeś w poprzednich krokach). Pamiętaj, że ten tryb może negatywnie wpłynąć na czas wykonywania zapytań.

# TransparencyModeON
source: Transparency mode is now ON!
de_de: Transparentmodus aktiviert!
pl_pl: Tryb transparentny włączony!

source: Transparency mode results
de_de: Ergebnisse im transparenten Modus
pl_pl: Wyniki trybu transparentnego
