Repository: skowront/SymulatorNSP2021
Catalog: SymulatorNSP.GUI.Core/Resources/Resource.*.resx
Languages: de_de, pl_pl

# TransparencyModeResultsExplanation
source: These results show how an algorithm can deal with custom user input and automatically classify misspelled string to existing bucket. Sometimes you will experience better fits and sometimes they will not be absolutely correct, but Levenstein and Hamming algorithms are the simplest of simplest. There are lots of algorithms that not only can classify data, but also themselves create groups for new data. So for example if GUS has not forseen that "european" or "opolean" or "wilamovian" nationality can be an option these algorithms could create these buckets themselves - all that would be left for GUS would be to accept or decline such a group.
de_de: Diese Ergebnisse zeigen, wie der Algorithmus mit nicht standardmäßigen Benutzerreaktionen auf vorhandene Optionen umgehen kann. Einige werden bessere und andere schlechtere Übereinstimmungen sehen, da Levenstein- und Hamming-Algorithmen zu den einfachsten der einfachsten gehören. Es gibt viele andere Algorithmen, die Daten nicht nur klassifizieren, sondern auch neue Gruppen von Daten erstellen können. Wenn also das Statistisches Hauptamt die Nationalität „Opole“ oder „Wilamowo“ nicht vorsah, könnte ein solcher Algorithmus selbst Gruppen erstellen, die das Statistisches Hauptamt nur noch genehmigen oder ablehnen müsste.
pl_pl: Te wyniki pokazują jak algorytm może radzić sobie z niestandardowymi odpowiedziami użytkownika do istniejących opcji. Niektórzy zobaczą lepsze, a inni gorsze dopasowania, bo algorytmy Levensteina i Hamminga należą do najprostszych z najprostszych. Istnieje wiele innych algoryrtmów, które nie tylko potrafią klasyfikować dane, ale także tworzyć nowe grupy danych. Tym samym jeśli GUS nie przewidział narodowości "opolskiej", czy "wilamowskiej", taki algorytm sam mógłby utworzyć grupy, które GUS musiałby tylko zatwierdzić lub odrzucić.

# TransparencyModeResultsLimitation
source: For optimization purposes this list may contain up to 100 fitting results, even though the querying process might have generated more.
de_de: Zu Optimierungszwecken kann die Liste bis zu 100 Einträge enthalten, auch wenn mehr Übereinstimmungsbeispiele generiert wurden.
pl_pl: Na potrzeby optymalizacji lista może zawierać do 100 wpisów, nawet jeśli samych przykładów dopasowań wygenerowano więcej.

# TransparencyModeWaringingTooltip
source: This will impact execution time!
de_de: Dies wirkt sich auf die Ausführungszeit der Abfrage aus!
pl_pl: To wpłynie na czas wykonywania zapytań!

source: Unknown
de_de: Unbekannt
pl_pl: Nieznane

# Welcome
source: Welcome to Unrecognized Statistical Office!
de_de: Herzlich Willkommen beim unbestimmt Statistischen Amt!
pl_pl: Witamy w Nieustalonym Urzędzie Statystycznym!

# Windows
source: Windows Application
de_de: Windows-Anwendung
pl_pl: Aplikacja na Windows
