Repository: skowront/SymulatorNSP2021
Catalog: SymulatorNSP/Shared/WebsiteLocResources/WebsiteLoc.*.resx
Languages: de_de, pl_pl

# AboutContent
source: Project was initiated by REGIOS Association to show the innefficiency of Central Statistical Office (GUS) in Poland. Unlike GUS we believe in full transparency and we share the source code of the application on a Github Repository.
de_de: Das Projekt wurde von der REGIOS Gesellschaft initiiert, um die Ineffizienz des Statistischen Hauptamts (GUS) in Polen aufzuzeigen. Im Gegensatz zum Statistischen Hauptamt setzen wir auf Transparenz und stellen deshalb den Quellcode der Anwendung auf dem Github-Repository zur Verfügung.
pl_pl: Projek został zainicjowany przez Stowarzyszenie REGIOS by pokazać nieefektywność Głównego Urzędu Statystycznego (GUS) w Polsce. W przeciwieństwie do GUS-u wierzymy w transparentność i dlatego udostępniamy kod źródłowy aplikacji na repozytorium Github.

# AboutLabel
source: About
de_de: Über das Projekt
pl_pl: O projekcie

# ApplicationContact
source: Application developer: tomasz.skowron@regios.org.pl
de_de: Anwendungsentwickler: tomasz.skowron@regios.org.pl
pl_pl: Twórca aplikacji: tomasz.skowron@regios.org.pl

# BackgroundDescription
source: In 2021 in Poland Central Statistical Office (GUS) performed a National Census (NSP). However they did not publish any results about ethnic and national structure for more than a year after the census was closed. It is worth noting that some information was published by GUS in Q4 2022 and it was used to create a default configuration for SymulatorNSP application. On this website you can check how much faster your browser is than whole GUS office, that could not manage to calculate those results for more than a year.
de_de: Im Jahr 2021 führte das Statistische Hauptamt in Polen die Volkszählung durch. Ergebnisse zur national-ethnischen Struktur veröffentlichten sie jedoch erst mehr als ein Jahr nach Ende der Volkszählung. Im vierten Quartal 2022 gab es nur einige Restdaten, die zur Erstellung dieser App verwendet wurden. Auf dieser Seite sehen Sie, wie viel schneller Ihr Browser ist als das gesamte Statistische Hauptamt, das die Ergebnisse über ein Jahr lang nicht ausgewertet hat!
pl_pl: W 2021 roku, w Polsce, Główny Urząd Statystyczny przeprowadził Narodowy Spis Powszechny. Jednakże nie opublikowali wyników o strukturze narodowo-etnicznej przez ponad rok po zakończeniu spisu. Pojawiły się tylko pewne szczątkowe dane w czwartym kwartale 2022, które wykorzystano do stworzenia tej aplikacji. Na tej stronie zobaczysz ile razy szybsza jest twoja przeglądarka od całego biura GUS, które nie poradziło sobie z analizą wyników przez ponad rok!

# BackgroundHeader
source: Background
de_de: Einführung
pl_pl: Wprowadzenie

# BrowserLimitExplanation
source: Unfortunately browser version supports up to 1.000.000 generated records. Later you may choose to query more records, but in browser version it will be done using the same dataset, just multiple times. For full experience without this limitation please check out the PC version of NSP Simulator 2022.
de_de: Leider unterstützt die Browserversion der Anwendung bis zu 1 Million generierte Datensätze. In den nächsten Schritten können Sie wählen, ob Sie mehr Datensätze analysieren möchten, als generiert werden, aber in der Browserversion wird es einfach eine mehrfache Ausführung von Abfragen auf dieselben Daten sein. Die PC-Version (Windows) des NSP-Simulators hat diese Einschränkung nicht. Wir laden Sie ein, sich damit vertraut zu machen.
pl_pl: Niestety przeglądarkowa wersja aplikacji wspiera do 1 mln wygenerowanych rekordów. W dalszych krokach możesz wybrać, by przeanalizować więcej rekordów niż liczba wygenerowanych, z tym, że w wersji przeglądarkowej będzie to po prostu wielokrotne wykonanie kwerend na tych samych danych. Wersja Symulatora NSP dla komputerów PC (z Windows) nie ma takiego ograniczenia, zapraszamy do zapoznania się z nią.

# BrowserLimitHeader
source: Browser limit reached!
de_de: Browserlimit erreicht!
pl_pl: Osiągnięto limit przeglądarki!

# BrowserLimitOneThread
source: Unfortunately at the moment the application supports only 1 thread for the browser. If you want to test your performance with multiple threads chech out the PC version.
de_de: Leider unterstützt die Browseranwendung im Moment maximal 1 Thread. Wenn Sie Ihren Computer mit CPU-Multithreading testen möchten, sehen Sie sich den NSP-Simulator für PC (Windows) an.
pl_pl: Niestety w tej chwili aplikacja przeglądarkowa wspiera maksymalnie 1 wątek. Jeśli chcesz przetestować swój komputer wykorzystując wielowątkowść procesora zapoznaj się z wersją Symulatora NSP dla komputerów PC (z Windows).

# CheckOutMoreHeader
source: Remember that this is just a browser!
de_de: Denken Sie daran, es ist nur ein Browser!
pl_pl: Pamiętaj, to tylko przeglądarka!

# CheckOutMoreValue
source: While testing the Windows version of NSP Simulator 2021, we managed to query 38 mln results in less than 5 seconds! Also feel free to explore our advanced NSP Simulator Online, where you can configure the way that records are generated, add errors into the records, and explore performance of the searching algorithm when discance calculating methods (Levenstein and Hamming) are used to bucket misspelled strings into available options.
de_de: Als wir die PC-Version des NSP-Simulators (Windows) getestet haben, erreichten wir 38 Millionen Abfragen in weniger als 5 Sekunden! Wir empfehlen Ihnen, sich mit der Vollversion des NSP-Simulators für Browser und des NSP-Simulators für PCs (Windows) vertraut zu machen, in denen Sie konfigurieren können, wie Datensätze generiert werden, und die Leistung von Algorithmen testen können, die Entfernungen bearbeiten (Levenstein und Hamming). Klassifizieren Sie Datensätze mit Fehlern in die verfügbaren Optionen.
pl_pl: Kiedy testowaliśmy wersję Symulatora NSP dla komputerów PC (z Windows) osiągnęliśmy 38mln zapytań w mniej niż 5 sekund! Zachęcamy do zapoznania się z pełną wersją Symulatora NSP dla przeglądarek oraz Symulatorem NSP dla komputerów PC (z Windows), gdzie możesz skonfigurować sposób generowania rekordów, zbadać wydajność algorytmów wykorzystujących odległości edycyjne (Levensteina i Hamminga) do klasyfikowania rekordów z błędami do dostępnych opcji.

source: Close
de_de: Schließen
pl_pl: Zmknij

# ContactLabel
source: Contact
de_de: Kontakt
pl_pl: Kontakt

# GDPRContact
source: GDPR: rodo@regios.org.pl
de_de: DSGVO: rodo@regios.org.pl
pl_pl: RODO: rodo@regios.org.pl

# GUSForPCLabel
source: Windows NSP Simulator
de_de: NSP-Simulator für Windows
pl_pl: Symulator NSP dla Windows

# GUSOnlineLabel
source: Online NSP Simulator (full version)
de_de: NSP Online-Simulator (Vollversion)
pl_pl: Symulator NSP Online (pełna wersja)

source: Hint
de_de: Tipp
pl_pl: Wskazówka

# HomePage
source: Home
de_de: Startseite
pl_pl: Strona główna

source: Language
de_de: Sprache
pl_pl: Język

# LeaderboardLabel
source: Leaderboard
de_de: Anzeigetafel
pl_pl: Tabela wyników

# MediaContact
source: Media: biuro@regios.org.pl
de_de: Medien: biuro@regios.org.pl

# NextLabel
source: Next
de_de: Nächste
pl_pl: Następny

# OtherContact
source: Other: biuro@regios.org.pl
de_de: Andere: biuro@regios.org.pl
pl_pl: Inne: biuro@regios.org.pl

# PreviousLabel
source: Previous
de_de: Vorherige
pl_pl: Poprzedni

# QueryAmountRemark
source: Start small, go big! Remember that browser applications are a lot slower than standard executables. We highly recommend to go with 1 mln records for starters. Remember to check out Symulator NSP for Windows later and see the true power of moder computation. In both cases you will, most likely, leave GUS behind.
de_de: Start small, go big! Denken Sie daran, dass Browseranwendungen langsamer sind als ausführbare Standardprogramme, die Sie auf Ihrem Computer installieren. Werfen Sie einen Blick auf den NSP-Simulator für PC (Windows) und sehen Sie die echte Rechenleistung heutiger Maschinen. Sowohl im Browser als auch in der Windows-Anwendung lässt Ihr Rechner jedoch das Statistische Hauptamt hinter sich.
pl_pl: Start small, go big! Pamiętaj, że aplikacje przeglądarkowe są wolniejsze niż standardowe programy wykonywalne, które instalujesz na komputerze. Zapoznaj się z wersją Symulatora NSP dla komputerów PC (z Windows) i zobacz prawdziwą moc obliczeniową współczesnych maszyn. Jednakże zarówno w przeglądarce, jak i aplikacji dla Windows twój komputer i tak zostawi GUS w tyle.

# RecommendedPopulationSize
source: For browsers we recommend to generate at least 10000 records.
de_de: Für Browser empfehlen wir, mindestens 10.000 Datensätze zu generieren.
pl_pl: Dla przeglądarek rekomendujemy wygenerowanie co najmniej 10000 rekordów.

source: Refresh
de_de: Erfrischen
pl_pl: Odśwież

# SelectQueryAmountDescription
source: Select number of rows to be queried
de_de: Wählen Sie die Anzahl der zu filternden Datensätze aus
pl_pl: Wybierz liczbę rekordów do przefiltrowania

source: Server unavailable
de_de: Server nicht verfügbar
pl_pl: Serwer niedostępny

# SubmitYourResults
source: Submit your results to leaderboard
de_de: An die Anzeigetafel senden
pl_pl: Wyślij do tablicy wyników

source: This can take a while.
de_de: Das kann eine Weile dauern.
pl_pl: To może chwilę potrwać.

# ThisCanTakeAWhileExplanation
source: Querying 38 mln records with a browser can take several minutes. The same can be done in seconds if you will use our NSP Simulator for Windows PC. Remember to check it out later.
de_de: Das Abfragen von 38 Millionen Datensätzen in einem Browser dauert einige Minuten. Dasselbe kann in Sekundenschnelle mit der NSP-Simulator-Anwendung für PC (Windows) erreicht werden, vergessen Sie nicht, es auszuprobieren.
pl_pl: Odpytanie 38 mln rekordów w przeglądarce zajmie kilka minut. To samo można osiągnąć w ciągu sekund z aplikacją Symulatora NSP dla komputerów PC (z Windows), nie zapomnij, żeby się z nią zapoznać.

source: Try again later...
de_de: Bitte versuchen Sie es später noch einmal...
pl_pl: Spróbuj ponownie później...

# UnhandledErrorMessage
source: An error has occurred, sorry! Please reload the page...
de_de: Ein Fehler ist aufgetreten, sorry! Seite neuladen...
pl_pl: Wystąpił błąd, przepraszamy! Przeładuj stronę...

# WebsiteTitle
source: NSP Simulator 2021
de_de: NSP 2021-Simulator
pl_pl: Symulator NSP 2021

# WelcomeHeader
source: Welcome to NSP Simulator 2021 site!
de_de: Willkommen auf der NSP Simulator 2021-Website!
pl_pl: Witamy na stronie Symulatora NSP 2021!

# WelcomeSubHeader
source: Here you can check how much faster is your PC than Central Statistical Office (GUS) in Poland.
de_de: Hier können Sie überprüfen, wie viel schneller Ihr Computer ist als das Statistische Hauptamt (GUS).
pl_pl: Tu sprawdzisz o ile szybszy jest twój komputer od Głównego Urzędu Statystycznego (GUS).
